app/Controllers/Autor.php

    public function index()
    {
        $dados = $this->autorModel->findAll();
---
SELECT *
FROM `autor`