app/Controllers/Emprestimo.php

SELECT *
FROM `emprestimo`
SELECT *
FROM `aluno`
SELECT *
FROM `usuario`
SELECT *
FROM `obra`
SELECT *
FROM `livro`
---
    public function index()
    {
        $dados = $this->EmprestimoModel->findAll();
        $dadosaluno = $this->AlunoModel->findAll();
        $dadosusuario = $this->UsuarioModel->findAll();
        $dadosobra = $this->ObraModel->findAll();
        $dadoslivro = $this->LivroModel->findAll();

UPDATE `livro` SET `disponivel` = 0
WHERE `livro`.`id` IN ('26')
INSERT INTO `emprestimo` (`id_usuario`, `data_inicio`, `prazo`, `id_livro`, `id_aluno`) VALUES ('1', '2024-06-21', '5', '26', '3')
---
    public function cadastrar()
    {
        $Emprestimo = $this->request->getPost();
        $this->LivroModel->update($Emprestimo['id_livro'],['disponivel' => 0]);
        $this->EmprestimoModel->save($Emprestimo);

SELECT *
FROM `emprestimo`
WHERE `emprestimo`.`id` = '54'
---
    public function devolucao($id)
    {
        $dados = $this->EmprestimoModel->find($id);