app/Controllers/Livro.php

SELECT *
FROM `livro`
SELECT *
FROM `obra`
---
    public function index()
    {
        $dados = $this->livroModel->findAll();
        $obras = $this->obraModel->findAll();