app/Controllers/Obra.php

SELECT *
FROM `obra`
SELECT *
FROM `editora`
---
    public function index()
    {
        $obras = $this->obraModel->findAll();
        $editoras = $this->editoraModel->findAll();